HW01_solution_logistic/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>readme</title>
<!-- 2015-03-23 Mon 01:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ryu Asakawa" />
</head>
<body>
<div id="content">
<h1 class="title">readme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. How to extract features for the dataset</a>
<ul>
<li><a href="#sec-1-1">1.1. Basic methods</a></li>
<li><a href="#sec-1-2">1.2. Detail</a></li>
</ul>
</li>
<li><a href="#sec-2">2. How to run your code, from data preprocessing to training/testing/evaluation, step by step.</a></li>
<li><a href="#sec-3">3. What’s the final average precision, recall and F1 Score.</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> How to extract features for the dataset</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Basic methods</h3>
<div class="outline-text-3" id="text-1-1">
<p>
tf-idf &amp; logistic regression
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Detail</h3>
<div class="outline-text-3" id="text-1-2">
<p>
First, we read all documents from <code>exam_place/train/[baseball | hockey]/</code>, get all words from the documents by split each document by space. Purge all special characters except a-zA-Z and turn all uppercase characters to downcase for better extraction.
</p>

<p>
To avoid over-fitting, after the first step, we got two hashes which stores the words occurance rank of type baseball and hockey. To reduce the affects of common words which has no special relation with the type. We define, only when the occure frequency differs large enough, which is 2 times here, could be the real features. At the same time, tf-idf is also an effective way to avoid over-fitting after our pre-selection.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How to run your code, from data preprocessing to training/testing/evaluation, step by step.</h2>
<div class="outline-text-2" id="text-2">
<p>
Code including rotate test is fully constructed for a one-command running.
<code>ruby rotate.rb</code> will start the automatic process of feature extraction and rotate test. Ensure the following directory exists
</p>
<ul class="org-ul">
<li><code>exam_place/train/baseball</code>
</li>
<li><code>exam_place/train/hockey</code>
</li>
<li><code>exam_place/test/baseball</code>
</li>
<li><code>exam_place/test/hockey</code>
</li>
</ul>

<p>
and your ruby version is over 1.9.3 (ruby -v), jruby is recommended from the cosideration of execution speed.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What’s the final average precision, recall and F1 Score.</h2>
<div class="outline-text-2" id="text-3">
<p>
The output of one run, the test dataset size is <code>199(baseball) + 199(hockey) equals tp + fp + tn + fn</code> :
</p>
<pre class="example">
$ ruby rotate.rb 
ruby rotate.rb 
[tp, tn, fp, fn]
[184, 191, 8, 15]
True:0.9422110552763819
False:0.05778894472361809
[tp, tn, fp, fn]
[182, 195, 4, 17]
True:0.9472361809045227
False:0.052763819095477386
[tp, tn, fp, fn]
[190, 193, 6, 9]
True:0.9623115577889447
False:0.03768844221105527
[tp, tn, fp, fn]
[189, 195, 4, 10]
True:0.964824120603015
False:0.035175879396984924
[tp, tn, fp, fn]
[188, 197, 2, 11]
True:0.9673366834170855
False:0.032663316582914576
</pre>

<p>
To calculate the final results.
</p>
<pre class="example">
precision = [0.9583333333333334, 0.978494623655914, 0.9693877551020408, 0.9792746113989638, 0.9894736842105263] 
recall = [0.9246231155778895, 0.914572864321608, 0.9547738693467337, 0.949748743718593, 0.9447236180904522]
f1 = [0.9411764705882352, 0.9454545454545454, 0.9620253164556962, 0.9642857142857144, 0.9665809768637531] 
f1_avg = 0.9559046047295888
</pre>
</div>
</div>
</div>
</body>
</html>
